#   Найти все делители данного натурального числа N без числа и 1.
N = 150751
k = 0
for d in range (1, N//2+1):
        if N % d == 0:
              k+=1
              print(d)
print(k)
              
      


