# диагностика 11 2022
# определите количество трехначных чисел, записанных в шестеричной
# системе счисления, в записи которых не менее одной цифры 5
##k = 0
##for x in '012345':
##    for y in '012345':
##        for z in '012345':
##            s = x + y + z
##            if '5' in s:
##                k += 1
##                print(s,k)
##print(k)
# ответ 80

# второй способ
alf = '012345'
k = 0
for i in range(100,1000):
    x = str(i)
    if '5' in x and x[0] in alf and x[1] in alf and x[2] in alf:
        k += 1
print(k)
